In [27]:
import numpy as np
import pandas as pd

In [56]:
arr=np.arange(0,16).reshape(4,4)
s=pd.DataFrame(arr)
s

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [57]:
col=[1,2,3,4]
row=['row 4','row 5','row 6','row 7']
arr1=np.arange(0,16).reshape(4,4)
s1=pd.DataFrame(arr,index=row,columns=col)
s1

        1   2   3   4
row 4   0   1   2   3
row 5   4   5   6   7
row 6   8   9  10  11
row 7  12  13  14  15

In [58]:
s1['Hello']=[3,4,5,6]

In [66]:
s1

        1   2   3   4  Hello
row 4   0   1   2   3      3
row 5   4   5   6   7      4
row 6   8   9  10  11      5
row 7  12  13  14  15      6

In [68]:
s1.drop('row 4', axis=0)
s1.drop('row 7', axis=0)

       1  2   3   4  Hello
row 4  0  1   2   3      3
row 5  4  5   6   7      4
row 6  8  9  10  11      5

In [99]:
s1.replace(4,'NaN')
s1

        1   2   3   4  Hello
row 4   0   1   2   3      3
row 5   4   5   6   7      4
row 6   8   9  10  11      5
row 7  12  13  14  15      6

In [100]:
s1.loc["row 4",:]

1        0
2        1
3        2
4        3
Hello    3
Name: row 4, dtype: int64

In [101]:
s1.loc["row 6",2]

9

In [106]:
s1.head(2)
print(s1.at['row 5',2])

5

In [114]:
df=pd.DataFrame({"Amit":[10,20,30],
                "Barsa":[40,50,60],
                "Chin":[11,12,33]},index=["test x","test y","test z"])
df

        Amit  Barsa  Chin
test x    10     40    11
test y    20     50    12
test z    30     60    33

In [117]:
#Display the students having greater than 30
#display the students having between 30 and 40
print(df[(df>=30)&(df<40)])

        Amit  Barsa  Chin
test x   NaN    NaN   NaN
test y   NaN    NaN   NaN
test z  30.0    NaN  33.0

In [118]:
print(df.sort_index(axis=0))

        Amit  Barsa  Chin
test x    10     40    11
test y    20     50    12
test z    30     60    33

In [119]:
print(df.sort_index(axis=1))

        Amit  Barsa  Chin
test x    10     40    11
test y    20     50    12
test z    30     60    33

In [8]:
df1=pd.DataFrame({"Amit":[1,2,3],
                "Barsa":[4,5,6],
                "Chin":[7,8,9]},index=["test x","test y","test z"])
df1

        Amit  Barsa  Chin
test x     1      4     7
test y     2      5     8
test z     3      6     9

In [9]:
print(df1.sort_index(axis=0))

        Amit  Barsa  Chin
test x     1      4     7
test y     2      5     8
test z     3      6     9

In [10]:
print(df1.sort_index(axis=1))

        Amit  Barsa  Chin
test x     1      4     7
test y     2      5     8
test z     3      6     9

In [19]:
print(df1.sort_values(by='test z',axis=1,ascending=False))

        Chin  Barsa  Amit
test x     7      4     1
test y     8      5     2
test z     9      6     3

In [20]:
print(df1.sort_values(by='Barsa',axis=0,ascending=False))

        Amit  Barsa  Chin
test z     3      6     9
test y     2      5     8
test x     1      4     7

In [35]:
data={"Name":["Somen","Anurag","Abhijit","Avinash"],
        "Age:":[21,22,24,20],
         "salary":[85,93,78,88]}
df=pd.DataFrame(data)
print(df)
df.to_csv("SalarySlip.csv",index=False)
print("Csv file success")

      Name  Age:  salary
0    Somen    21      85
1   Anurag    22      93
2  Abhijit    24      78
3  Avinash    20      88
Csv file success

In [36]:
df2=pd.read_csv("SalarySlip.csv")
df2

      Name  Age:  salary
0    Somen    21      85
1   Anurag    22      93
2  Abhijit    24      78
3  Avinash    20      88

In [38]:
df3=pd.read_csv("/home/iteradmin/Downloads/SalarySlip.csv")
df3

      Name  Age:  salary
0    Somen    21      85
1   Anurag    22      93
2  Abhijit    24      78
3  Avinash    20      88

In [39]:
df2.describe()

            Age:     salary
count   4.000000   4.000000
mean   21.750000  86.000000
std     1.707825   6.271629
min    20.000000  78.000000
25%    20.750000  83.250000
50%    21.500000  86.500000
75%    22.500000  89.250000
max    24.000000  93.000000

In [41]:
df2["Name"].describe()

count         4
unique        4
top       Somen
freq          1
Name: Name, dtype: object

In [42]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age:    4 non-null      int64
 2   salary  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [55]:
df2.duplicated()
df2.drop_duplicates(inplace=True,keep=False)

In [56]:
df2.dropna()

      Name  Age:  salary
0    Somen    21      85
1   Anurag    22      93
2  Abhijit    24      78
3  Avinash    20      88